/****************************************************************************/
/*                                                                          */
/*              创龙 DSP6748 开发板相关函数                                 */
/*                                                                          */
/*              2014年07月12日                                              */
/*                                                                          */
/****************************************************************************/
#include "hw_types.h"

#include "hw_usbOtg_C6748.h"
#include "soc_C6748.h"
#include "hw_psc_C6748.h"    
#include "psc.h"

/****************************************************************************/
/*                                                                          */
/*              使能 USB 中断                                               */
/*                                                                          */
/****************************************************************************/
void USBEnableInt(unsigned int ulBase)
{
    HWREG(ulBase + USB_0_INTR_MASK_SET) = 0x01FF1E1F;
}

/****************************************************************************/
/*                                                                          */
/*              清除 USB 中断                                               */
/*                                                                          */
/****************************************************************************/
void USBClearInt(unsigned int ulBase)
{
    HWREG(ulBase + USB_0_INTR_SRC_CLEAR) = 
        HWREG(ulBase + USB_0_INTR_SRC);
}

/****************************************************************************/
/*                                                                          */
/*              USB 时钟使能                                                */
/*                                                                          */
/****************************************************************************/
void USBModuleClkEnable(unsigned int ulIndex, unsigned int ulBase)
{
    PSCModuleControl(SOC_PSC_1_REGS,1, 0, PSC_MDCTL_NEXT_ENABLE);
}

/****************************************************************************/
/*                                                                          */
/*              USB 时钟禁用                                                */
/*                                                                          */
/****************************************************************************/
void USBModuleClkDisable(unsigned int ulIndex, unsigned int ulBase)
{
    PSCModuleControl(SOC_PSC_1_REGS,1, 0, PSC_MDCTL_NEXT_DISABLE);
}

/****************************************************************************/
/*                                                                          */
/*              返回识别码                                                  */
/*                                                                          */
/****************************************************************************/
unsigned int USBVersionGet(void)
{
    return 1;
}
